In [1]:
#From list of lists, array of arrays, list of series
import numpy as np
import pandas as pd

two_dimension_lists = [['Connie', 'Seoul', 'Korean'], ['Johanna', 'Berlin', 'German'], ['Juliette', 'Paris', 'French']]
two_dimension_array = np.array(two_dimension_lists)
series_lists = [
    pd.Series(['Connie', 'Seoul', 'Korean']),
    pd.Series(['Johanna', 'Berlin', 'German']),
    pd.Series([['Juliette', 'Paris', 'French']])
]

df1 = pd.DataFrame(two_dimension_lists)
df2 = pd.DataFrame(two_dimension_array)
df3 = pd.DataFrame(series_lists)

In [2]:
df1

          0       1       2
0    Connie   Seoul  Korean
1   Johanna  Berlin  German
2  Juliette   Paris  French

In [3]:
df2

          0       1       2
0    Connie   Seoul  Korean
1   Johanna  Berlin  German
2  Juliette   Paris  French

In [4]:
df3

                           0       1       2
0                     Connie   Seoul  Korean
1                    Johanna  Berlin  German
2  [Juliette, Paris, French]     NaN     NaN

In [5]:
#From dict of lists, dict of arrays, dict of series
names = ['Connie', 'Johanna', 'Juliette']
city = ['Seoul', 'Berlin', 'Paris']
nationality = ['Korean', 'German', 'French']

dict1 = {
    'name':names,
    'city':city,
    'nationality':nationality
}

dict2 = {
    'name' : np.array(names),
    'city' : np.array(city),
    'nationality' : np.array(nationality)
}
dict3 = {
    'name' : pd.Series(names),
    'city' : pd.Series(city),
    'nationality' : pd.Series(nationality)
}

df4 = pd.DataFrame(dict1)
df5 = pd.DataFrame(dict2)
df6 = pd.DataFrame(dict3)

In [6]:
df4

       name    city nationality
0    Connie   Seoul      Korean
1   Johanna  Berlin      German
2  Juliette   Paris      French

In [7]:
df5

       name    city nationality
0    Connie   Seoul      Korean
1   Johanna  Berlin      German
2  Juliette   Paris      French

In [8]:
df6

       name    city nationality
0    Connie   Seoul      Korean
1   Johanna  Berlin      German
2  Juliette   Paris      French

In [9]:
#From list of dicts
my_list = [
    {'name': 'Connie', 'city' : 'Seoul', 'nationality' : 'Korean'},
    {'name': 'Johanna', 'city' : 'Berlin', 'nationality' : 'German'},
    {'name': 'Juliette', 'city' : 'Paris', 'nationality' : 'France'}
]
df7 = pd.DataFrame(my_list)
df7

       name    city nationality
0    Connie   Seoul      Korean
1   Johanna  Berlin      German
2  Juliette   Paris      France